# Created by kun yang at 2018/7/25
@refund
Feature: 融管系统各退费流程
  #测试融管系统中的各种退费流程包含（新退费，意向金退费，紧急退费，投诉强制退费）


#========================================================================================================================
#  新退费（会员费退费）：融资顾问→销售总监→分总→分公司财务→总部应收会计→CFO→总部付款出纳
#========================================================================================================================
    @create_newRefund
    Scenario: 顾问创建新退费申请
      Given 销售顾问登录融管系统
      When 查询客户
      When 打开【我的客户】→【合同管理】→【新合同】，点击【退款】按钮并填写退款详情，提交审核

   @director_appv_newRefund
   Scenario: 销售总监审批新退费申请
    Given 销售总监登录融管系统
    When 打开【销售管理】→【新退费审批--总监】→【待审批】，选择待审批的新退费申请，点击【审批】，填写【审批意见】并点击【通过】按钮

  @divManager_appv_newRefund
  Scenario: 分总审批新退费申请
    Given 分公司总经理登录融管
    When 打开【销售管理】→【新退费审批】→【待审批】，选择待审批的新退费申请，点击【审批】，填写【审批意见】并点击【通过】按钮

  @finace_appv_newRefund
  Scenario: 分公司财务审批新退费申请
    Given 分公司财务登录融管系统
    When 打开【出纳】→【新退费审批】→【待审批】，选择待审批的新退费申请，点击【审批】，填写【审批意见】并点击【通过】按钮

  @accountant_appv_newRefund
  Scenario: 总部应收会计审批新退费申请
    Given 总部应收会计登录融管系统
    When 打开【付款专员】→【新退费审批】→【待审批】，选择【城市】，选择待审批的新退费申请，点击【审批】，填写【审批意见】并点击【通过】按钮

  @CFO_appv_newRefund
  Scenario: CFO审批新退费申请
    Given CFO登录融管系统
    When 打开【CFO】→【新退费审批】→【待审批】，选择【城市】，选择待审批的新退费申请，点击【审批】，填写【审批意见】并点击【通过】按钮

  @cashier_appv_newRefund
  Scenario: 总部付款出纳审批新退费申请
    Given 总部付款出纳登录融管系统
    When 打开【钱智总部出纳】→【新退费审批】→【待审批】，选择【城市】，选择待审批的新退费申请，点击【审批】，填写【审批意见】并点击【通过】按钮

#========================================================================================================================
#  意向金退费：融资顾问→销售总监→分总→分公司财务→总部应收会计→总部付款出纳
#========================================================================================================================
  @create_aimRefund
  Scenario: 顾问创建意向金退费申请
    Given 销售顾问登录融管系统
    When 查询客户
    When 打开【我的客户】→【合同管理】→【新合同】，在“意向金”列点击【退款】按钮并填写退款详情，提交审核

   @director_appv_aimRefund
   Scenario: 销售总监审批意向金退费申请
    Given 销售总监登录融管系统
    When 打开【销售管理】→【意向金退款审批】→【待审批】，选择待审批的意向金退费申请，点击【审批】，填写【审批意见】并点击【通过】按钮

  @divManager_appv_aimRefund
  Scenario: 分总审批意向金退费申请
    Given 分公司总经理登录融管
    When 打开【销售管理】→【意向金退费审批--分总】→【待审批】，选择待审批的意向金退费申请，点击【审批】，填写【审批意见】并点击【通过】按钮

  @finance_appv_aimRefund
  Scenario: 分公司财务审批意向金退费申请
    Given 分公司财务登录融管系统
    When 打开【出纳】→【意向金退费审批】→【待审批】，选择待审批的意向金退费申请，点击【审批】，填写【审批意见】并点击【通过】按钮

  @accountant_appv_aimRefund
  Scenario: 总部应收会计审批意向金退费申请
    Given 总部应收会计登录融管系统
    When 打开【付款专员】→【意向金退费审批】→【待审批】，选择【城市】，选择待审批的意向金退费申请，点击【审批】，填写【审批意见】并点击【通过】按钮

  @cashier_appv_aimRefund
  Scenario: 总部付款出纳审批意向金退费申请
    Given 总部付款出纳登录融管系统
    When 打开【钱智总部出纳】→【意向金退费审批】→【待审批】，选择【城市】，选择待审批的意向金退费申请，点击【审批】，填写【审批意见】并点击【通过】按钮


#========================================================================================================================
#  紧急退费：分总→分公司财务→总部应收会计→CF0→总部付款出纳→销售经理→分公司财务
#========================================================================================================================
  @create_urgenRefund
  Scenario: 分总创建紧急退费
    Given 分公司总经理登录融管
    When 打开【销售管理】→【紧急退费发起】，选择要退费的合同，点击【退费】按钮,填写退费详情并提交审核

  @finance_appv_urgenRefund
  Scenario: 分公司财务审批紧急退费--初审
    Given 分公司财务登录融管系统
    When 打开【出纳】→【紧急退费初审】→【待审批】，选择需要审批的紧急退费申请，点击【审批】按钮，并填写“审批意见”，点击【通过】按钮

  @accountant_appv_urgenRefund
  Scenario: 总部应收会计审批紧急退费
    Given 总部应收会计登录融管系统
    When 打开【付款专员】→【紧急退费审批】→【待审批】，选择需要审批的紧急退费申请，点击【审批】按钮，并填写“审批意见”，点击【通过】按钮

  @CFO_appv_urgenRefund
  Scenario: CFO审批紧急退费
    Given CFO登录融管系统
    When 打开【CFO】→【紧急退费审批】→【待审批】，选择需要审批的紧急退费申请，点击【审批】按钮，并填写“审批意见”，点击【通过】按钮

  @cashier_appv_urgenRefund
  Scenario: 总部付款出纳审批紧急退费
    Given 总部付款出纳登录融管系统
    When 打开【钱智总部出纳】→【紧急退费审批】→【待审批】，选择需要审批的紧急退费申请，点击【审批】按钮，并填写“审批意见”，点击【通过】按钮

  @salesManager_appv_urgenRefund
  Scenario: 销售经理审批紧急退费
    Given 销售经理登录融管系统
    When 打开【综合管理】→【紧急退费审批】→【待审批】，选择需要审批的紧急退费申请，点击【审批】按钮，并填写“审批意见”，点击【通过】按钮

  @fince_final_appv_urgenRefund
  Scenario: 分公司财务审批紧急退费--终审
    Given 分公司财务登录融管系统
    When 打开【出纳】→【紧急退费终审】→【待审批】，选择需要审批的紧急退费申请，点击【审批】按钮，并填写“审批意见”，点击【通过】按钮

#========================================================================================================================
#  投诉强制退费：客服→客服总监→分公司财务→总部应收会计→CF0→总部付款出纳（知会分总）
#========================================================================================================================
  @create_forceRefund
  Scenario: 客服创建投诉强制退费
    Given 客服专员登录融管系统
    When 打开【投诉强制退费】→【强制退费发起】，选择需要退费的合同，点击【退费】按钮并填写退费详情，提交审核

  @CustomerService_appv_forceRefund
  Scenario: 客服审批投诉强制退费
    Given 客服专员登录融管系统
    When 打开【客服专员】→【投诉强制退费审批】→【待审批】，选择要审批的强制退费申请，点击【审批】按钮并填写退费详情，提交审核

  @CustomerDirector_appv_forceRefund
  Scenario: 客服总监审批投诉强制退费
    Given 客服总监登录融管系统
    When 打开【销售管理】→【投诉强制退费审批】→【待审批】，选择要审批的强制退费申请，点击【审批】按钮并填写审批意见，点击【通过】按钮

  @finance_appv_forceRefund
  Scenario: 分公司财务投诉强制退费
    Given 分公司财务登录融管系统
    When 打开【出纳】→【投诉强制退费审批】→【待审批】，选择要审批的强制退费申请，点击【审批】按钮并填写审批意见，点击【通过】按钮

  @accountant_appv_forceRefund
  Scenario: 总部应收会计投诉强制退费
    Given 总部应收会计登录融管系统
    When 打开【付款专员】→【投诉强制退费审批】→【待审批】，选择要审批的强制退费申请，点击【审批】按钮并填写审批意见，点击【通过】按钮

  @CFO_appv_forceRefund
  Scenario: CFO投诉强制退费
    Given CFO登录融管系统
    When 打开【CFO】→【投诉强制退费审批】→【待审批】，选择要审批的强制退费申请，点击【审批】按钮并填写审批意见，点击【通过】按钮

  @cashire_appv_forceRefund
  Scenario: 总部付款出纳投诉强制退费
    Given 总部付款出纳登录融管系统
    When 打开【钱智总部出纳】→【投诉强制退费审批】→【待审批】，选择要审批的强制退费申请，点击【审批】按钮并填写审批意见，点击【通过】按钮






